{
  "products": [
    {"name": "Марк Лутц: Python. Карманный справочник", "content": "Этот краткий справочник по Python карманного типа обновлен с учетом версий 3.4 и 2.7 и очень удобен для наведения быстрых справок в процессе разработки программ на Python. В лаконичной форме здесь представлены все необходимые сведения о типах данных и операторах Python, специальных методах, встроенных функциях и исключениях, наиболее употребительных стандартных библиотечных модулях и других примечательных языковых средствах Python. Данное справочное пособие написано Марком Лутцом - известным и широко признанным во всем мире инструктором по Python. Оно послужит отличным дополнением к обширной литературе по Python, включая следующие книги самого автора: Learning Python (издательство O'Reilly), а также Programming Python (издательство O'Reilly). В пятом издании этого справочника рассматриваются следующие вопросы Встроенные типы объектов, включая числа, списки, словари, множества и многое другое Операторы и синтаксис для создания и обработки объектов Функции и модули для структуризации и повторного использования кода Инструментальные средства объектно-ориентированного программирования на Python Встроенные функции, исключения и атрибуты Специальные методы перегрузки операторов Широко употребляемые стандартные библиотечные модули и расширения Параметры командной строки и инструментальные средства разработки Дополнительные рекомендации и идиомы Прикладной интерфейс API базы данных SQL в Python. 5-е издание."},
    {"name": "Дженнифер Роббинс: HTML5. Карманный справочник", "content": "Хотите быстро найти описание элемента или атрибута HTML5, используемого на веб-странице или в веб-приложении. Перед вами классический справочник, который веб-дизайнеры и веб-разработчики стараются всегда держать под рукой на протяжении вот уже более 15 лет. Пятое издание книги включает полное описание элементов и атрибутов HTML5 в соответствии со стандартами HTML5 Candidate Recommendation, HTML5.1 Working Draft и WHATWG. Особенности справочника: упорядоченный по алфавиту список элементов и атрибутов из HTML5, HTML5.1 и стандарта WHATWG; примеры разметки, категории контента, модели контента и требования к начальному-конечному тегу для каждого элемента; описание различий между спецификациями HTML5 и HTML4.01; таблицы специальных символов; обзор библиотек API, применяемых в HTML5. Независимо от того, являетесь ли вы опытным разработчиком сайтов или же хотите быстро создать сайт в соответствии с последними стандартами, эта полезная книга окажется для вас просто незаменимой. Дженнифер Роббинс входила в состав команды, разработавшей в 1993 году первый коммерческий веб-сайт - Global Network Navigator (GNN), предназначенный для издательства O'Reilly. Перу Дженнифер принадлежит множество книг по веб-дизайну и сетевому программированию. 5-е издание."},
    {"name": "Леа Веру: Секреты CSS.Идеальные решения ежедневных задач", "content": "Гибкий легкий код, соответствующий стандартам — его можно получить, если подойти к проблеме аналитически. Леа Веру познакомит вас с недокументированными приемами, позволяющими найти изящные решения для самого широкого круга задач веб-дизайна. В основу книги легли доклады автора на шестидесяти международных конференциях веб-разработчиков, так что она затрагивает самые актуальные темы — от взаимодействия с пользователем до типографики и визуальных эффектов. Множество книг, доступных на сегодняшнем рынке, документируют возможности CSS от A до Я. Хорошо это или плохо, но «Секреты CSS» — не одна из них. Ее назначение — заполнить пробелы в знаниях, оставшиеся после того, как вы уже ознакомились со справочными материалами, открыть ваш разум новым способам применения функциональности, которая вам уже известна, а также познакомить вас с полезными возможностями CSS, которые не так модны и популярны, но заслуживают не меньшей любви. Главная задача этой книги — научить вас решать проблемы с помощью CSS."},
    {"name": "Фримен, Робсон: Изучаем программирование на JavaScript", "content": "Вы готовы сделать шаг вперед в веб-программировании и перейти от верстки в HTML и CSS к созданию полноценных динамических страниц. Тогда пришло время познакомиться с самым горячим языком программирования - JavaScript! С помощью этой книги вы узнаете все о языке JavaScript - от переменных до циклов. Вы поймете, почему разные браузеры по-разному реагируют на код и как написать универсальный код, поддерживаемый всеми браузерами. Вам станет ясно, почему с кодом JavaScript никогда не придется беспокоиться о перегруженности страниц и ошибках передачи данных. Не пугайтесь, даже если ранее вы не написали ни одной строчки кода, - благодаря уникальному формату подачи материала эта книга с легкостью проведет вас по всему пути обучения: от написания простейшего скрипта до создания сложных веб-проектов, которые будут работать во всех современных браузерах. Особенностью этого издания является уникальный способ подачи материала, выделяющий серию Head First издательства O'Reilly в ряду множества скучных книг, посвященных программированию."},
    {"name": "Джош Локхарт: Современный PHP. Новые возможности и передовой опыт", "content": "PHP переживает ренессанс, хотя это и трудно заметить, просматривая устаревшие электронные пособия. Из этого практического руководства вы узнаете, как PHP превратился в зрелый полнофункциональный объектно-ориентированный язык, с пространствами имен и постоянно растущей коллекцией библиотек компонентов. Джош Локхарт, создатель популярной инициативы по развитию лучших методик PHP The Right Way, демонстрирует новые возможности языка на практике. Вы узнаете о лучших методах проектирования и конструирования приложений, работы с базами данных, обеспечения безопасности, тестирования, отладки и развертывания. Если вы уже знакомы с языком PHP и желаете расширить свои знания о нем, то эта книга для вас. Несколько лет я искал книгу по PHP, которую мог бы рекомендовать как отражающую современное состояние языка и сообщества. С появлением книги Современный PHP, я, наконец, могу уверенно сделать это. Эд Финклер, разработчик и автор В программировании не изменяются только константы. Меняется PHP и вместе с ним должен меняться ваш подход к разработке приложений. Джош привел инструменты и идеи, знание которых поможет писать современный код на PHP."}
  ]
}